# AddWallBottomPeak

## Description
Adds a peak to the bottom of the referenced wall.

```pascal
PROCEDURE AddWallBottomPeak(
				wallHd         : HANDLE;
				offDistance    : REAL;
				heightDistance : REAL);
```

```python
def vs.AddWallBottomPeak(wallHd, offDistance, heightDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|wallHd|HANDLE|Handle to wall.|
|offDistance|REAL|Offset distance of peak from wall start.|
|heightDistance|REAL|Height of peak.|

## Examples
eateWallObject}}

## Version
Availability: from VectorWorks9.0

## Category
* Objects - Walls